plugins/floor/tests/mutants/moved-gate-selection.patch
diff --git a/bin/run.sh b/bin/run.sh
index e289a3a..b49c40c 100644
--- a/bin/run.sh
+++ b/bin/run.sh
@@ -2078,7 +2078,7 @@ gates() {
     # more: a grader that reads a run it should have refused answers wrongly once, and a recorder
     # writes a row nothing takes back. Both of these refused everywhere but here.
     refuse_renamed_run "$dir"
-    refuse_moved_selection "$dir" "$(unit_targets_file "$dir")" || exit 10
+    :
     refuse_an_item_another_host_holds "$dir"
 
     check_charter "$dir"
